[
  "Do you make a list when you shop?",
  "Do you make a list for your work? (Does it work?)",
  "Why don't some people like making lists?",
  "Do you like texting?",
  "Do you prefer sending or receiving messages?",
  "Have you ever received a confusing text message?",
  "In what circumstances is making a phone call better than sending a text message?",
  "What do you always do in a hurry? Why?",
  "What kind of things would you never do in a hurry?",
  "Do you usually go out in a hurry?",
  "Do you like to be in a hurry?",
  "Where can you bargain? Why?",
  "How do you bargain?",
  "Do Vietnamese people bargain?",
  "What do you think of bargain?",
  "Have you visited a farm?",
  "What can you do on farm?",
  "Do you think farming is important?",
  "Are there any farms in your hometown?",
  "What kind of trees do people usually plant in your country?",
  "What kind of trees do people usually plant in your hometown?",
  "Have you ever planted trees?",
  "What kinds of trees do you plant?",
  "Do you like planting trees? Why?",
  "What's the decoration like in your home?",
  "What kind of decoration do you prefer?",
  "Do Vietnamese people like redecorating their homes?",
  "What's your favorite color when decoration your home?",
  "What kind of TV program do you like?",
  "Do you often watch program on the TV or on your cellphone?",
  "Do you like watching the same kind of program all the time?",
  "Do you talk with your friends about the program you watched?",
  "How do you celebrate new year?",
  "Do you still remember a new year that you celebrated?",
  "Do you have any ceremonies to celebrate the new year in your country?",
  "Why do people think new year is a new beginning?",
  "Is there anything that makes you feel happy lately?",
  "What do you do to stay happy?",
  "Can you stay happy all the time?",
  "Is it important to be happy?",
  "How often do you take rest?",
  "What do you usually do when you are resting?",
  "Do you take a nap when you are taking your rest?",
  "How do you feel after taking a nap?",
  "Do you like singing?",
  "When do you sing?",
  "Will you take singing lessons in the future?",
  "Did you enjoy singing when you were younger?",
  "Do you often get up early in the morning?",
  "What do you usually do when you get up early?",
  "Do you get up early on weekends?",
  "Which morning do you like best in a week?",
  "What scenery can you see from the window of your home?",
  "What scenery can you see from the window of your dormitory?",
  "Do you like to watch the scenery from your window?",
  "Do you want to live in a house with beautiful window views?",
  "How do you feel when you can't see any beautiful view from your window?",
  "Which part of your country do you want to live in?",
  "What makes you feel proud of your country?",
  "Do you know the history of your country well?",
  "Will you stay in Vietnam in the future?",
  "Is it easy for you to remember people's names?",
  "Can you remember the names of your childhood friends?",
  "Have you forgotten the name of someone you know?",
  "How would you feel if someone forgot your name?",
  "How to remember other people's names?"
]