[
  "Where is your hometown?",
  "Do you like your hometown? Why?",
  "How long have you been living in your hometown?",
  "Do you believe your hometown is a proper place to grow up? Why",
  "How could your hometown be improved?",
  "Has your hometown changed much since you were a child?",
  "Is there good public transportation in your hometown?",
  "Will you be moving away from your hometown?",
  "Do you like art?",
  "Did you learn to draw when you were a kid?",
  "Have you ever visited an art gallery?",
  "Is there any artwork on the wall in your room?",
  "Do you want to be an artist?",
  "Do you like modern art or traditional art?",
  "What snacks do you like to eat?",
  "What snacks did you eat when you were young?",
  "When do you usually eat snacks now?",
  "Do you think eating snacks are healthy?",
  "Have you ever learned about outer space and stars?",
  "Are you interested in films concerning outer space and stars?",
  "Do you want to go into outer space in the future?",
  "Do you often stay up late?",
  "Did you stay up late when you were a kid?",
  "What do you do when you stay up late?",
  "What does it feel like the following day when you stay up late?",
  "What is the weather like where you live?",
  "Do you prefer cold or hot weather?",
  "Do you prefer dry or wet weather?",
  "Do you get in the habit of checking the weather forecast?",
  "What subjects are you studying?",
  "Why did you choose the subjects you're studying?",
  "Do you like your subject?",
  "Do you prefer to study in the mornings or the afternoons?",
  "Do you miss being a student?",
  "As a student, are you looking forward to working?",
  "Do you like your job?",
  "What technology do you often use, computers or cell phones?",
  "What electronic devices have you bought lately?",
  "Is there any technology you want to buy?",
  "What benefits does technology bring to us?",
  "Where do you go to school?",
  "Do you go to a good school?",
  "Do you like your teachers?",
  "Do you like your current learning atmosphere?",
  "What are the differences between your school and other schools?",
  "Is there anything you want to change about your school?",
  "Do you often go to the library?",
  "What books or materials do you often read in a library?",
  "What do you usually do in a library other than reading?",
  "Do people in your country often go to the library?",
  "Do you know many small businesses where you live?",
  "Do you prefer buying things from big companies or small businesses?",
  "Have you ever worked in small businesses?",
  "Have you ever thought about starting your own business?",
  "Did you do puzzles in your childhood?",
  "When do you do puzzles, during trips, or when you feel bored?",
  "Do you like doing word puzzles or number puzzles? Which is more difficult for you?",
  "Do you think it is suitable for older people to do puzzles?",
  "Do you live in a house or a flat?",
  "Why do you live in an apartment/house?",
  "How long have you lived in your apartment/house?",
  "What do you like the most about your apartment/house?",
  "What is your favorite room? Why?",
  "Can you describe the view from your windows?",
  "Do you plan to live in your apartment/house in the future?",
  "What are the advantages of living in your own home?",
  "What kind of accommodation do you wish to have in the future?",
  "Can you tell me about your house when you were a child?",
  "Do you like singing?",
  "Have you ever learned how to sing?",
  "Who do you want to sing for?",
  "Do you think singing can bring happiness to people?",
  "What music do you like?",
  "What kinds of music do you like to listen to?",
  "Do you enjoy the same kind of music as your friends?",
  "Have you ever been to a concert before?",
  "What is the most popular type of music where you live?",
  "Which singer or musician would you like to see in person?",
  "Do you like art?",
  "Do you like visiting art galleries?",
  "Do you want to be an artist?",
  "Do you like modern art or traditional art?",
  "Where are you living now?",
  "What do you like most about where you live?",
  "What is the neighborhood like where you live?",
  "Do you have any friends there?",
  "What can be improved in the area where you live?",
  "Do you know any famous people in the area where you live?",
  "Do you intend to stay in the same area in the future?",
  "What kind of public transportation do you usually take?",
  "When do you usually take public transportation, in your everyday life or when traveling?",
  "Did you take public transport when you were a kid?",
  "Do most people prefer public transport?",
  "Do you do some cooking/help your family cook at home now?",
  "Did you do some house cleaning when you were young?",
  "Do you have breakfast at home every day?",
  "Do you want to learn how to cook well?",
  "Do you always bring a lot of keys with you?",
  "Have you ever lost your keys?",
  "How can we avoid losing keys?"
]